hubuhubu/nrf52-ble-mesh-data-collector/ble_app_uart - Mesh - Gateway/rbc_mesh/include/rbc_mesh.h
/***********************************************************************************
Copyright (c) Nordic Semiconductor ASA
All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

  1. Redistributions of source code must retain the above copyright notice, this
  list of conditions and the following disclaimer.

  2. Redistributions in binary form must reproduce the above copyright notice, this
  list of conditions and the following disclaimer in the documentation and/or
  other materials provided with the distribution.

  3. Neither the name of Nordic Semiconductor ASA nor the names of other
  contributors to this software may be used to endorse or promote products
  derived from this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
************************************************************************************/

#ifndef _RBC_MESH_H__
#define _RBC_MESH_H__
#include <stdint.h>
#include <stdbool.h>
#ifdef NRF51
#include "nrf.h"
#else
#include "nrf.h"
#endif
#include "nrf_sdm.h"
#include "ble.h"
#include "dfu_types_mesh.h"

#define RBC_MESH_ACCESS_ADDRESS_BLE_ADV             (0x8E89BED6) /**< BLE spec defined access address. */
#define RBC_MESH_INTERVAL_MIN_MIN_MS                (5) /**< Lowest min-interval allowed. */
#define RBC_MESH_INTERVAL_MIN_MAX_MS                (60000) /**< Highest min-interval allowed. */
#define RBC_MESH_VALUE_MAX_LEN                      (23) /**< Longest legal payload. */
#define RBC_MESH_INVALID_HANDLE                     (0xFFFF) /**< Designated "invalid" handle, may never be used */
#define RBC_MESH_APP_MAX_HANDLE                     (0xFFEF) /**< Upper limit to application defined handles. The last 16 handles are reserved for mesh-maintenance. */

#define RBC_MESH_GPREGRET_CODE_GO_TO_APP            (0x00) /**< Retention register code for immediately starting application when entering bootloader. The default behavior. */
#define RBC_MESH_GPREGRET_CODE_FORCED_REBOOT        (0x01) /**< Retention register code for telling the bootloader it's been started on purpose */

/*
   There are two caches in the framework:
   - The handle cache keeps track of the latest version number for each handle.
   - The data cache contains all handles currently being retransmitted by the device.
   If a handle falls out of the data cache, the device will stop broadcasting it.
   If a handle falls out of the handle cache, the device will not know whether updates
   to the handle are new or old.
*/

/** @brief Default value for the number of handle cache entries */
#ifndef RBC_MESH_HANDLE_CACHE_ENTRIES
    #if defined(WITH_ACK_MASTER) || defined (WITHOUT_ACK_MASTER)
          #define RBC_MESH_HANDLE_CACHE_ENTRIES           (105)
    #else
          #define RBC_MESH_HANDLE_CACHE_ENTRIES           (10)
    #endif      
#endif

/** @brief Default value for the number of data cache entries */
#ifndef RBC_MESH_DATA_CACHE_ENTRIES
    #if defined(WITH_ACK_MASTER) || defined (WITHOUT_ACK_MASTER)
         #define RBC_MESH_DATA_CACHE_ENTRIES             (105)
    #else
         #define RBC_MESH_DATA_CACHE_ENTRIES             (10)
    #endif
#endif

/** @brief Length of app-event FIFO. Must be power of two. */
#ifndef RBC_MESH_APP_EVENT_QUEUE_LENGTH
    #if defined(WITH_ACK_MASTER) || defined (WITHOUT_ACK_MASTER)
         #define RBC_MESH_APP_EVENT_QUEUE_LENGTH         (64)
    #else
         #define RBC_MESH_APP_EVENT_QUEUE_LENGTH         (8)
    #endif
#endif

/** @brief Length of low level radio event FIFO. Must be power of two. */
#ifndef RBC_MESH_RADIO_QUEUE_LENGTH
    #define RBC_MESH_RADIO_QUEUE_LENGTH             (8)
#endif

/** @brief Length of internal async-event FIFO. Must be power of two. */
#ifndef RBC_MESH_INTERNAL_EVENT_QUEUE_LENGTH
    #define RBC_MESH_INTERNAL_EVENT_QUEUE_LENGTH    (8)
#endif

/** @brief Size of packet pool. Only accounts for one packet in the app-space at a time. */
#ifndef RBC_MESH_PACKET_POOL_SIZE
    #define RBC_MESH_PACKET_POOL_SIZE               (RBC_MESH_DATA_CACHE_ENTRIES +\
                                                     RBC_MESH_APP_EVENT_QUEUE_LENGTH + \
                                                     RBC_MESH_RADIO_QUEUE_LENGTH + \
                                                     RBC_MESH_INTERNAL_EVENT_QUEUE_LENGTH +\
                                                     3)
#endif

#if (RBC_MESH_HANDLE_CACHE_ENTRIES < RBC_MESH_DATA_CACHE_ENTRIES)
    #error "The number of handle cache entries cannot be lower than the number of data entries"
#endif

/**
* @brief Rebroadcast value handle type
*
* @detailed Handle type used to identify a value in the mesh, is consistent
*   throughout the network
*/
typedef uint16_t rbc_mesh_value_handle_t;

/** @brief Event type enum. Identifies framework generated events */
typedef enum
{
    RBC_MESH_EVENT_TYPE_UPDATE_VAL,             /**< Another node has updated the value. Parameters in rx sub-structure. */
    RBC_MESH_EVENT_TYPE_CONFLICTING_VAL,        /**< Another node has a conflicting version of the value. Parameters in rx sub-structure.  */
    RBC_MESH_EVENT_TYPE_NEW_VAL,                /**< A previously unallocated value has been received and allocated. Parameters in rx sub-structure. */
    RBC_MESH_EVENT_TYPE_INITIALIZED,            /**< The framework has been initialized internally (most likely via serial interface). No parameters. */
    RBC_MESH_EVENT_TYPE_TX,                     /**< The indicated handle was transmitted. Parameters in tx sub-structure. */
    RBC_MESH_EVENT_TYPE_DFU_NEW_FW_AVAILABLE,   /**< The dfu module has detected that a newer version of the current firmware is available. Parameters in dfu.new_fw sub-structure. */
    RBC_MESH_EVENT_TYPE_DFU_RELAY_REQ,          /**< A DFU transfer is about to start in the network, and our device is able to act as a relay. Parameters in dfu.relay_req sub-structure. */
    RBC_MESH_EVENT_TYPE_DFU_SOURCE_REQ,         /**< A DFU transfer is about to start in the network, and our device is able to act as a source. Parameters in dfu.source_req sub-structure. */
    RBC_MESH_EVENT_TYPE_DFU_START,              /**< The dfu module has started its target role. Parameters in dfu.start sub-structure. */
    RBC_MESH_EVENT_TYPE_DFU_END,                /**< The dfu module has ended its target role. Paramters in dfu.end sub-structure. */
    RBC_MESH_EVENT_TYPE_DFU_BANK_AVAILABLE,     /**< The dfu module found a bank available for flashing. Parameters in dfu.bank sub-structure. */
} rbc_mesh_event_type_t;

/** @brief The various states of the mesh framework. */
typedef enum
{
    MESH_STATE_UNINITIALIZED,   /**< The mesh hasn't been initialized. */
    MESH_STATE_RUNNING,         /**< The mesh is currently running as normal. */
    MESH_STATE_STOPPED          /**< The mesh operation has been stopped. */
} rbc_mesh_state_t;

